## Plans :thumbsup:
<details>
  <summary><h2>Terrateam Plan Output :thumbsup:</h2></summary>


**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!   update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_cloudfunctions_function.my-cap-billing-function will be updated in-place
!   resource "google_cloudfunctions_function" "my-cap-billing-function" {
        id                    = "projects/terrateam-362405/locations/us-central1/functions/cap-billing-f4fa157c45218076"
        name                  = "cap-billing-f4fa157c45218076"
!       source_archive_object = "function-source.zip" -> "f8f80bcfde2696431ddd23e9073218d3"
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # google_project_iam_custom_role.my-cap-billing-role will be updated in-place
!   resource "google_project_iam_custom_role" "my-cap-billing-role" {
        id          = "projects/terrateam-362405/roles/myCapBilling"
        name        = "projects/terrateam-362405/roles/myCapBilling"
!       permissions = [
+           "ecretmanager.versions.access",
            # (1 unchanged element hidden)
        ]
        # (6 unchanged attributes hidden)
    }

  # google_storage_bucket_object.my-cap-billing-archive must be replaced
-/+ resource "google_storage_bucket_object" "my-cap-billing-archive" {
!       content_type     = "application/zip" -> (known after apply)
!       crc32c           = "34U3uQ==" -> (known after apply)
!       detect_md5hash   = "C6QrK061+HYIELhfutqkCw==" -> "different hash" # forces replacement
-       event_based_hold = false -> null
!       id               = "cb9078f6-88df-1a37-c39e-fd1a8f2a2b23-f8f80bcfde2696431ddd23e9073218d3" -> (known after apply)
+       kms_key_name     = (known after apply)
!       md5hash          = "C6QrK061+HYIELhfutqkCw==" -> (known after apply)
!       media_link       = "https://storage.googleapis.com/download/storage/v1/b/cb9078f6-88df-1a37-c39e-fd1a8f2a2b23/o/f8f80bcfde2696431ddd23e9073218d3?generation=1663266922329761&alt=media" -> (known after apply)
-       metadata         = {} -> null
        name             = "f8f80bcfde2696431ddd23e9073218d3"
!       output_name      = "f8f80bcfde2696431ddd23e9073218d3" -> (known after apply)
!       self_link        = "https://www.googleapis.com/storage/v1/b/cb9078f6-88df-1a37-c39e-fd1a8f2a2b23/o/f8f80bcfde2696431ddd23e9073218d3" -> (known after apply)
!       storage_class    = "STANDARD" -> (known after apply)
-       temporary_hold   = false -> null
        # (2 unchanged attributes hidden)
    }

Plan: 1 to add, 2 to change, 1 to destroy.

```

<details>
  <summary>To apply this directory and workspace...</summary>

```
terrateam apply dir:. workspace:default
```

</details>


</details>

To apply all these changes, comment:

```
terrateam apply
```

## Cost Estimation
**Total Monthly Difference: 0.06 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 0.00 | 0.06 | 0.06|
| | **Total** | **0.00** | **0.06** | **0.06** |
</details>

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
